#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0x738 - 0x678)
// BlueprintGeneratedClass GA_SpellBase.GA_SpellBase_C
class UGA_SpellBase_C : public UGA_TechniqueBase_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x678(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                          Cast_TPMontage;                                    // 0x680(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Cast_FPMontage;                                    // 0x688(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          SpellState_TPMontage;                              // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          SpellState_FPMontage;                              // 0x698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          SpellChargeUp_FPMontage;                           // 0x6A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          SpellChargeUp_TPMontage;                           // 0x6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         NoMontages;                                        // 0x6B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A8AC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          AnimTag;                                           // 0x6B4(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A8AD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBP_SpellAVFXComponent_C*              CachedSpellAVFXComp;                               // 0x6C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          SpellTag;                                          // 0x6C8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       ProjectileImpactRadius;                            // 0x6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MagicRating;                                       // 0x6D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A8AE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       BaseDuration;                                      // 0x6E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle      CurrentTarget_Data;                                // 0x6E8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_Character_C*                       OwningBPCharacter;                                 // 0x710(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       BloodMagicCost;                                    // 0x718(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CanCancel;                                         // 0x720(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A8AF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMetricsEventAttr>             Attributes;                                        // 0x728(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UGA_SpellBase_C* GetDefaultObj();

	void Create_Spell_Casted_Attributes(TArray<struct FMetricsEventAttr>* Attributes, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue, class UTechniqueDataAsset* K2Node_DynamicCast_AsTechnique_Data_Asset, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Conv_TextToString_ReturnValue, const struct FMetricsEventAttr& K2Node_MakeStruct_MetricsEventAttr, TArray<struct FMetricsEventAttr>& K2Node_MakeArray_Array);
	void CanAffordBloodCost(bool* CanAfford, double CallFunc_Get_Blood_Magic_Perk_Max_Health_Cost_Percentage_Health_Cost, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, bool CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue, bool CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1, float CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double CallFunc_Greater_DoubleDouble_A_ImplicitCast);
	void InitializeSpellAnimations(bool* bInitializedAllAnimations, const struct FItemDataReference& EquippedItemReference, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FGameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue, bool CallFunc_GetMontageSetForAction_bFoundMontageSet, const struct FAbilityMontages& CallFunc_GetMontageSetForAction_MontageSetForAction, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomFirstPersonItem, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomFirstPersonCharacter, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomThirdPersonItem, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomThirdPersonCharacter, const struct FGameplayTag& CallFunc_MakeLiteralGameplayTag_ReturnValue_1, bool CallFunc_GetMontageSetForAction_bFoundMontageSet_1, const struct FAbilityMontages& CallFunc_GetMontageSetForAction_MontageSetForAction_1, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomFirstPersonItem_1, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomFirstPersonCharacter_1, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomThirdPersonItem_1, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomThirdPersonCharacter_1, bool CallFunc_GetMontageSetForAction_bFoundMontageSet_2, const struct FAbilityMontages& CallFunc_GetMontageSetForAction_MontageSetForAction_2, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomFirstPersonItem_2, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomFirstPersonCharacter_2, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomThirdPersonItem_2, class UAnimMontage* CallFunc_GetRandomMontagesFromSet_RandomThirdPersonCharacter_2, const struct FItemDataReference& CallFunc_GetItemID_OutItemReference, bool CallFunc_IsValid_ReturnValue_2);
	void ApplyPerks(class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_3, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1, bool CallFunc_HasMatchingGameplayTag_ReturnValue_1, bool CallFunc_IsValid_ReturnValue);
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags, class UAbilitySystemComponent* LAbilitySystem, const struct FGameplayTagContainer& LRelevantTags, const struct FGameplayTag& Temp_struct_Variable, const struct FGameplayTagContainer& CallFunc_K2_CanActivateAbility_RelevantTags, bool CallFunc_K2_CanActivateAbility_ReturnValue, bool CallFunc_IsStateActive_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void GetOrAddSpellAVFXComp(class UBP_SpellAVFXComponent_C** SpellAVFXComp, class UBP_SpellAVFXComponent_C* TempSpellAVFXComp, bool CallFunc_IsValid_ReturnValue, class UBP_SpellAVFXComponent_C* CallFunc_AddComponentByClass_ReturnValue, class UBP_SpellAVFXComponent_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2);
	void CastSpell(const struct FGameplayAbilityTargetDataHandle& TargetData, TArray<struct FMetricsEventAttr>& CallFunc_Create_Spell_Casted_Attributes_Attributes, class ANWXPlayerState* CallFunc_GetPlayerState_PlayerState, class ANWXPlayerState* CallFunc_GetPlayerState_PlayerState_1, TScriptInterface<class IBPI_TaskTracking_C> K2Node_DynamicCast_AsBPI_Task_Tracking, bool K2Node_DynamicCast_bSuccess);
	void StopSpellChargeUpAnim(double BlendOutTime, bool CallFunc_IsValid_ReturnValue);
	void PlaySpellChargeUpAnim(bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void FireSpellProjectile(class UClass* ProjectileClass, TArray<class UClass*>& ImpactGameplayEffects, double Velocity, class AActor* SeekingTarget, class UCurveFloat* RadiusScalingOverride, class UCurveFloat* RadiusScalingCurve, double CallFunc_ScaleSpellRadius_ScaledRadius, TScriptInterface<class IBPI_WeaponUser_C> K2Node_DynamicCast_AsBPI_Weapon_User, bool K2Node_DynamicCast_bSuccess, const struct FVector& CallFunc_GetShootVector_ForwardVector, TScriptInterface<class IBPI_WeaponUser_C> K2Node_DynamicCast_AsBPI_Weapon_User_1, bool K2Node_DynamicCast_bSuccess_1, const struct FVector& CallFunc_GetProjectileStart_ProjectileStart, const struct FVector& CallFunc_Conv_DoubleToVector_ReturnValue, const struct FVector& CallFunc_Multiply_VectorVector_ReturnValue, const struct FTransform& CallFunc_Conv_VectorToTransform_ReturnValue, const struct FS_ProjectileSourceData& K2Node_MakeStruct_S_ProjectileSourceData, bool CallFunc_IsServer_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsBP_Projectile_Base, bool K2Node_ClassDynamicCast_bSuccess, bool CallFunc_Not_PreBool_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_ProjectileBase_C* CallFunc_FinishSpawningActor_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ConsumeConsumable(class UBP_ConsumableComponent_C* LConsumableComponent, class AActor* LPlayer, class ABP_Character_C* K2Node_DynamicCast_AsBP_Character, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class ILoadoutReadInterface> CallFunc_GetEquippedItem_self_CastInput, class AEquippableItem* CallFunc_GetEquippedItem_ReturnValue, class AActor* CallFunc_GetOwningActorFromActorInfo_ReturnValue, class UBP_ConsumableComponent_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ValidateTargetData(const struct FGameplayAbilityTargetDataHandle& TargetData, bool* IsValid);
	void StopCastMontage(bool CallFunc_IsValid_ReturnValue);
	void PlayTPCastMontage(bool CallFunc_IsValid_ReturnValue);
	void StopSpellStateIdle(double BlendOutTime, bool CallFunc_IsValid_ReturnValue);
	void PlaySpellStateIdle(bool CallFunc_IsValid_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void ValidateAndInitialize(bool* Success, bool CallFunc_InitializeSpellAnimations_bInitializedAllAnimations, double CallFunc_GetMagicRating_MagicRating, class ABP_Character_C* K2Node_DynamicCast_AsBP_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class UBP_SpellAVFXComponent_C* CallFunc_GetOrAddSpellAVFXComp_SpellAVFXComp, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_IsGameplayTagValid_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, float K2Node_VariableSet_MagicRating_ImplicitCast);
	void OnNotifyEnd_E4FF7AD74570439F7CF90B824A72A123(class FName NotifyName);
	void OnNotifyBegin_E4FF7AD74570439F7CF90B824A72A123(class FName NotifyName);
	void OnInterrupted_E4FF7AD74570439F7CF90B824A72A123(class FName NotifyName);
	void OnBlendOut_E4FF7AD74570439F7CF90B824A72A123(class FName NotifyName);
	void OnCompleted_E4FF7AD74570439F7CF90B824A72A123(class FName NotifyName);
	void EventReceived_6CF67E914BC8090A112615A450815717(const struct FGameplayEventData& Payload);
	void ReleaseSpell(const struct FGameplayAbilityTargetDataHandle& TargetData);
	void K2_ActivateAbilityFromEvent(struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void SetupCancelEvent();
	void K2_CommitExecute();
	void ExecuteUbergraph_GA_SpellBase(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FGameplayEventData& K2Node_CustomEvent_Payload, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FGameplayEventData& Temp_struct_Variable, const struct FGameplayTag& Temp_struct_Variable_1, const struct FGameplayTag& Temp_struct_Variable_2, TArray<struct FGameplayEffectCue>& Temp_struct_Variable_3, const struct FTagValueContainer& Temp_struct_Variable_4, const struct FHitResult& Temp_struct_Variable_5, const struct FGameplayTagContainer& Temp_struct_Variable_6, class FName K2Node_CustomEvent_NotifyName_3, bool Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, class FName K2Node_CustomEvent_NotifyName_4, const struct FGameplayAbilityTargetDataHandle& K2Node_CustomEvent_TargetData, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool CallFunc_K2_HasAuthority_ReturnValue, class USkeletalMeshComponent* CallFunc_GetSK_HMM_FP_ReturnValue, class UPlayMontageCallbackProxy* CallFunc_CreateProxyObjectForPlayMontage_ReturnValue, bool CallFunc_IsValid_ReturnValue, const struct FGameplayEventData& K2Node_Event_EventData, bool K2Node_Event_bWasCancelled, bool CallFunc_GetTechniqueActivationTag_Success, const struct FGameplayTag& CallFunc_GetTechniqueActivationTag_Tag, class UAbilityTask_WaitGameplayEvent* CallFunc_WaitGameplayEvent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, class AActor* CallFunc_GetOwningActorFromActorInfo_ReturnValue, bool CallFunc_IsServer_ReturnValue, bool CallFunc_IsServer_ReturnValue_1, class AActor* CallFunc_GetOwningActorFromActorInfo_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, bool Temp_bool_Has_Been_Initd_Variable, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_K2_HasAuthority_ReturnValue_1, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue, TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput, bool CallFunc_HasMatchingGameplayTag_ReturnValue, bool CallFunc_IsValid_ReturnValue_4, double CallFunc_Get_Blood_Magic_Perk_Max_Health_Cost_Percentage_Health_Cost, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_1, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_2, bool CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute, float CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue_5, TScriptInterface<class IDamageEventInterface> CallFunc_DamageActor_self_CastInput, const struct FTagValueContainer& CallFunc_DamageActor_AggregatedDamageTags, class AActor* CallFunc_GetOwningActorFromActorInfo_ReturnValue_2, bool Temp_bool_IsClosed_Variable, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_3, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_6, class FName Temp_name_Variable, bool CallFunc_IsValid_ReturnValue_7, bool CallFunc_EqualEqual_NameName_ReturnValue, class FName K2Node_CustomEvent_NotifyName, class FName K2Node_CustomEvent_NotifyName_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, bool CallFunc_CanAffordBloodCost_CanAfford, class UAbilitySystemComponent* CallFunc_GetAbilitySystemComponent_ReturnValue_4, double CallFunc_Get_Blood_Magic_Perk_Magic_Power_Multiplier_PowerMultiplier, double CallFunc_Subtract_DoubleDouble_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, double CallFunc_GetMagicRating_MagicRating, const struct FGameplayEffectSpecHandle& CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, class FName K2Node_CustomEvent_NotifyName_2, const struct FGameplayEffectSpecHandle& CallFunc_AssignTagSetByCallerMagnitude_ReturnValue, const struct FActiveGameplayEffectHandle& CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float CallFunc_DamageActor_BaseDamage_ImplicitCast, float CallFunc_AssignTagSetByCallerMagnitude_Magnitude_ImplicitCast);
};

}


